import cv2

# ۱. مسیر عکس خودت رو اینجا بنویس
# مثلاً از همین عکس‌هایی که داشتی: "IMG_20260830_165003.jpg"
image_path = "arya.jpg"

# ۲. خواندن عکس
img = cv2.imread(image_path)

# چک کردن اینکه آیا عکس درست لود شده یا نه
if img is None:
    print("خطا: عکسی پیدا نشد! مسیر فایل رو چک کن.")
else:
    # ۳. نمایش عکس در یک پنجره
    cv2.imshow('My Photo', img)

    # ۴. منتظر موندن تا کاربر دکمه‌ای رو بزنه
    # عدد 0 اینجا خیلی مهمه! یعنی تا ابد منتظر بمون تا وقتی که کاربر دکمه‌ای رو فشار بده
    print("برای بستن پنجره، یک دکمه روی کیبورد بزن.")
    cv2.waitKey(0)

    # ۵. بستن پنجره
    cv2.destroyAllWindows()